protected/app/User.php

    public static function username($id)
    {
        $data = User::where('id', $id)->first();
---
select * from `users` where `id` = 40 limit 1

    public static function atasan($id_user)
    {
        $data = DB::table('users')
        ->leftJoin('users as bawahan', 'bawahan.atasan_id', 'users.id')
        ->where('users.jabatan', 'Business Division Head')
        ->where('users.id', $id_user)
        ->value('bawahan.id');
---
select `bawahan`.`id` from `users` left join `users` as `bawahan` on `bawahan`.`atasan_id` = `users`.`id` where `users`.`jabatan` = 'Business Division Head' and `users`.`id` = 40 limit 1