protected/app/Models/LoanApplicant.php

    public static function pengajuanInduk($id)
    {
        $data = LoanApplicant::where('id', $id)->first();
---
select * from `loan_applicants` where `id` = '1' limit 1