protected/app/Http/Controllers/NakController.php

    public function index ($id)
    {
        $data = LoanApplicant::with('master_bpr')->where('uuid',$id)->first();
        $departemenHead = User::select('atasan_id')->toBase()->where('id', $data->user_id)->first();
        // BWMK
        $informasi_grup_usaha = $data->master_bpr[0]->informasi_grup_usaha;

        $bwmk = LoanApplicant::with(['master_bpr'=> function($query) use ($informasi_grup_usaha){
            $query->where('informasi_grup_usaha', $informasi_grup_usaha);
        }])->sum('plafond');

        $grup_usaha = LoanApplicant::with(['master_bpr'=> function($query) use ($informasi_grup_usaha){
            $query->where('informasi_grup_usaha', $informasi_grup_usaha);
        }])->get();

        $parsing = [
            'data'=>$data,
            'departemenHead'=>User::select('id','name', 'atasan_id')->toBase()->where('id', $departemenHead->atasan_id)->first(),
            'divisionHead'=>User::select('id', 'name', 'atasan_id')->toBase()->where('id', $departemenHead->atasan_id)->first(),
            'relationshipManager'=>User::select('name')->toBase()->where('id', $data->user_id)->first(),
            'id'=>$id,
            'bwmk'=>$bwmk,
            'status_nak'=>StatusNak::where('loan_applicant_id', $id)->toBase()->first(),
---
select * from `loan_applicants` where `uuid` = '5a24dc80-01ae-424f-b0ff-1657ba854ccf' limit 1
select `atasan_id` from `users` where `id` = '16' limit 1
select sum(`plafond`) as aggregate from `loan_applicants`
select * from `loan_applicants`
select `id`, `name`, `atasan_id` from `users` where `id` = '19' limit 1
select `name` from `users` where `id` = '16' limit 1
select * from `status_nak` where `loan_applicant_id` = '5a24dc80-01ae-424f-b0ff-1657ba854ccf' limit 1