protected/app/Http/Controllers/OpiniController.php

    public function complianceOpini ($id)
    {
        $data = LoanApplicant::where('uuid',$id)->firstOrFail();
        $opini = DB::table('opini_compliance')->where('loan_applicant_id', $id)->first();
        $opini_id = $opini->id ?? null;

        $div_head = $data->compliance_division_head;
        $dep_head_compliance = $data->compliance_departemen_head;
        $dep_head = $data->aml_cft_dep_head;

        $jabatan = Auth::user()->jabatan_user->nama_jabatan;
        $kertas_kerja = $data->kertas_kerja_screening_cadeb;
        $status = $data->return_status_kertas_kerja_screening;
        $array_status = array(null, 'Yes');

        $status_dep_head = $data->return_status_kertas_kerja_screening_dep_head;
        $status = $data->return_status_kertas_kerja_screening;
        $array_status = array(null, 'Yes');

        $setting_flow = DB::table('setting_flows')->where('jabatan_id', Auth::user()->jabatan)->first();

        $pertanyaan = DB::table('master_pertanyaan')
        ->selectRaw('master_pertanyaan.id as pertanyaan_id, master_jawaban.id as jawaban_id, pertanyaan')
        ->selectRaw('jawaban')
        ->leftJoin('master_jawaban', 'master_jawaban.pertanyaan_id', 'master_pertanyaan.id')
        ->where('jenis_pertanyaan', 'Compliance')
        ->get()
        ->groupBy([
            function($val){ return $val->pertanyaan; },
        ]);

        $divisionHead = DB::table('users')
        ->leftJoin('jabatan', 'jabatan.id', 'users.jabatan')
        ->where('nama_jabatan', 'Compliance Division Head')
        ->select('users.id', 'name')
        ->first();

        $sectionHead = DB::table('users')
        ->leftJoin('jabatan', 'jabatan.id', 'users.jabatan')
        ->where('nama_jabatan', 'Regulatory Compliance Section Head')
        ->select('users.id','name')
        ->first();

        $depHead = DB::table('users')
        ->leftJoin('jabatan', 'jabatan.id', 'users.jabatan')
        ->where('nama_jabatan', 'Regulatory Compliance Department Head')
        ->select('users.id','name')
        ->first();

        $opini_detail = DB::table('opini_compliance_detail')
        ->select(
            'opini_compliance_detail.id as id_detail',
            'identifikasi',
            'pertanyaan',
            'opini_compliance_detail.pertanyaan_id',
            'jawaban',
            'catatan_rekomendasi_mitigasi'
        )
        ->leftJoin('master_pertanyaan', 'master_pertanyaan.id', 'opini_compliance_detail.pertanyaan_id')
        ->leftJoin('master_jawaban', 'master_jawaban.pertanyaan_id', 'master_pertanyaan.id')
        ->where('opini_compliance_id', $opini_id)
        ->where('jenis_pertanyaan', 'Compliance')
        ->get()
        ->groupBy([
             function($val){ return $val->pertanyaan; },
             function($val){ return $val->id_detail; },
             function($val){ return $val->catatan_rekomendasi_mitigasi; }
        ]);

        $parsing = [
            'id'=>$id,
            'opini'=>$opini,
            'opini_detail'=>$opini_detail,
            'pertanyaan'=>$pertanyaan,
            'divisionHead'=>$divisionHead,
            'sectionHead'=>$sectionHead,
            'depHead'=>$depHead,
            'data'=>$data,
            'setting_flow'=>DB::table('setting_flows')->where('jabatan_id', Auth::user()->jabatan)->first(),
            'jenis_pengajuan'=>$data->jenis_pengajuan,
            'status_nak'=>StatusNak::where('loan_applicant_id', $id)->toBase()->first(),
---
select * from `loan_applicants` where `uuid` = '5a24dc80-01ae-424f-b0ff-1657ba854ccf' limit 1
select * from `opini_compliance` where `loan_applicant_id` = '5a24dc80-01ae-424f-b0ff-1657ba854ccf' limit 1
select * from `jabatan` where `jabatan`.`id` = '23' and `jabatan`.`id` is not null limit 1
select * from `setting_flows` where `jabatan_id` = '23' limit 1
select master_pertanyaan.id as pertanyaan_id, master_jawaban.id as jawaban_id, pertanyaan, jawaban from `master_pertanyaan` left join `master_jawaban` on `master_jawaban`.`pertanyaan_id` = `master_pertanyaan`.`id` where `jenis_pertanyaan` = 'Compliance'
select `users`.`id`, `name` from `users` left join `jabatan` on `jabatan`.`id` = `users`.`jabatan` where `nama_jabatan` = 'Compliance Division Head' limit 1
select `users`.`id`, `name` from `users` left join `jabatan` on `jabatan`.`id` = `users`.`jabatan` where `nama_jabatan` = 'Regulatory Compliance Section Head' limit 1
select `users`.`id`, `name` from `users` left join `jabatan` on `jabatan`.`id` = `users`.`jabatan` where `nama_jabatan` = 'Regulatory Compliance Department Head' limit 1
select `opini_compliance_detail`.`id` as `id_detail`, `identifikasi`, `pertanyaan`, `opini_compliance_detail`.`pertanyaan_id`, `jawaban`, `catatan_rekomendasi_mitigasi` from `opini_compliance_detail` left join `master_pertanyaan` on `master_pertanyaan`.`id` = `opini_compliance_detail`.`pertanyaan_id` left join `master_jawaban` on `master_jawaban`.`pertanyaan_id` = `master_pertanyaan`.`id` where `opini_compliance_id` is null and `jenis_pertanyaan` = 'Compliance'
select * from `status_nak` where `loan_applicant_id` = '5a24dc80-01ae-424f-b0ff-1657ba854ccf' limit 1

    public function opiniCompliance(Request $request)
    {
        DB::beginTransaction();

        try {

            $cek = opiniCompliance::where('loan_applicant_id', $request->loan_applicant_id)->first();

            $opini = OpiniCompliance::updateOrCreate([
                'loan_applicant_id'=>$request->loan_applicant_id
            ],[
                'section_head'=>$request->section_head,
                'division_head'=>$request->division_head,
                'departemen_head'=>$request->departemen_head,
                'catatan'=>$request->catatan,
                'lembar_opini'=>$request->lembar_opini
            ]);

            if($cek == null):
                for($i=0; $i<count($request->pertanyaan_id); $i++):

                    DB::table('opini_compliance_detail')
                    ->insert([
                        'opini_compliance_id'=>$opini->id,
                        'pertanyaan_id'=>$request->pertanyaan_id[$i],
                        'catatan_rekomendasi_mitigasi'=>$request->catatan_rekomendasi_mitigasi[$i],
                        'identifikasi'=>$request->identifikasi[$i],
                        'created_at'=>\Carbon\Carbon::now(),
                    ]);
---
insert into `opini_compliance` (`loan_applicant_id`, `section_head`, `division_head`, `departemen_head`, `catatan`, `lembar_opini`, `updated_at`, `created_at`) values ('5a24dc80-01ae-424f-b0ff-1657ba854ccf', '38', '34', '37', '<p>Bumi pertiwi</p>', '<p>Lembaran opini nga</p>', '2023-12-05 11:05:55', '2023-12-05 11:05:55')
select * from `opini_compliance` where (`loan_applicant_id` = '5a24dc80-01ae-424f-b0ff-1657ba854ccf') limit 1
insert into `opini_compliance_detail` (`opini_compliance_id`, `pertanyaan_id`, `catatan_rekomendasi_mitigasi`, `identifikasi`, `created_at`) values (8, '13', 'Dont try suicide', 'Tidak ada', '2023-12-05 11:05:55')


            endif;

            $update = LoanApplicant::where('uuid', $request->loan_applicant_id)->first();
---
select * from `loan_applicants` where `uuid` = '5a24dc80-01ae-424f-b0ff-1657ba854ccf' limit 1