protected/app/Http/Controllers/ProsesWorkFlowController.php

    public function index(Request $request)
    {
        $data = LoanApplicant::master();

        $parameter['data'] = $data;

        if($request->ajax()):

            return LoanApplicant::datatabel($parameter)
            ->addColumn('action', function($row){

                $id=$row->id;
                $uuid = $row->uuid;

                $user_level_id = User::username(Auth::user()->id)->jabatan;
                $user_level_id = SettingFlow::where('jabatan_id', $user_level_id)->value('jabatan_id');
                $permission = SettingFlow::where('jabatan_id', $user_level_id)->first();
---
select `jabatan_id` from `setting_flows` where `jabatan_id` = '32' limit 1
select * from `setting_flows` where `jabatan_id` = '32' limit 1